EDT/УТ/src/Documents/ТабельУчетаРабочегоВремени/ТабельУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчетаРабочегоВремени</name>
  <registerRecords>AccumulationRegister.ОтработанноеВремяПоТабелю</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПериодаРасчета</name>
    <type>
      <types>EnumRef.ПериодыРасчетаЗП</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтработанноеВремя</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтработанногоВремени</name>
      <type>
        <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяПоГрафику</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПоГрафику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/ОтработанноеВремяПоТабелю/ОтработанноеВремяПоТабелю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОтработанноеВремяПоТабелю</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтработанногоВремени</name>
    <type>
      <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПериодаРасчета</name>
    <type>
      <types>EnumRef.ПериодыРасчетаЗП</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/ТабельУчетаРабочегоВремени/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
                |   ОтработанноеВремяПоТабелю.Регистратор,
                |   ОтработанноеВремяПоТабелю.Сотрудник,
                |   ОтработанноеВремяПоТабелю.Подразделение
                |ИЗ
                |   РегистрНакопления.ОтработанноеВремяПоТабелю КАК ОтработанноеВремяПоТабелю
                |ГДЕ
                |   ОтработанноеВремяПоТабелю.Период МЕЖДУ &ДатаНач И &ДатаКон
                |   И ОтработанноеВремяПоТабелю.Сотрудник В(&Сотрудники)
                |   И ОтработанноеВремяПоТабелю.Подразделение = &Подразделение
                |   И ОтработанноеВремяПоТабелю.Регистратор <> &Регистратор
                |   И ОтработанноеВремяПоТабелю.ВидПериодаРасчета = &ВидПериодаРасчета";
	Таб = ОтработанноеВремя.Выгрузить();			
	Таб.Свернуть("Сотрудник", "ОтработаноЧасов");
	МасСотрудников = Таб.ВыгрузитьКолонку("Сотрудник");
	Зап.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Зап.УстановитьПараметр("ДатаКон", КонецМесяца(Период));
	Зап.УстановитьПараметр("Сотрудники", МасСотрудников);
	Зап.УстановитьПараметр("Подразделение", Подразделение);
	Зап.УстановитьПараметр("Регистратор", Ссылка);
	Зап.УстановитьПараметр("ВидПериодаРасчета", ВидПериодаРасчета);
	
	Если Не Зап.Выполнить().Пустой() Тогда
		#Если Клиент Тогда
			Сообщить("Проведение не может быть выполнено, так в периоде " + ПредставлениеПериода(НачалоМесяца(Период), КонецМесяца(Период), "ДЛФ=DD") + " уже проведен табель учета рабочего времений!");
		#КонецеСли	
		Отказ = истина;
		Возврат;
	КонецеСли;	
	
	
	// регистр ОтработанноеВремяПоТабелю 
	Движения.ОтработанноеВремяПоТабелю.Записывать = Истина;
	Движения.ОтработанноеВремяПоТабелю.Очистить();
	Для Каждого ТекСтрокаОтработанноеВремя Из ОтработанноеВремя Цикл
		Движение = Движения.ОтработанноеВремяПоТабелю.Добавить();
		Движение.Период = Период;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник = ТекСтрокаОтработанноеВремя.Сотрудник;
		Движение.ДатаПериода = ТекСтрокаОтработанноеВремя.Дата;
		Если ТекСтрокаОтработанноеВремя.ВидОтработанногоВремени.РабочееВремя Тогда
			Движение.Показатель = ТекСтрокаОтработанноеВремя.ОтработаноЧасов;
		КонецеСли;	
		Движение.ВидОтработанногоВремени = ТекСтрокаОтработанноеВремя.ВидОтработанногоВремени;
        Движение.ВидПериодаРасчета = ВидПериодаРасчета;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
